                                # Easy

# Задание-1:
# Напишите функцию, переводящую км в мили и выводящую информацию на консоль
# т.е функция ничего не возвращает, а выводит на консоль ответ самостоятельно
# Предполагается, что 1км = 1,609 мили
# def convert(km):
#     miles = km * float(0.6)
#     print('В ', km, 'км: ', round(miles, 2), 'миль')
#     print(f'{miles:.2f}')
#
#
# km = float(input('Введите км, для конвертирования в мили: '))
#
# (convert(km))

# Задание-2:
# Напишите функцию, округляющую полученное произвольное десятичное число
# до кол-ва знаков (кол-во знаков передается вторым аргументом).
# Округление должно происходить по математическим правилам (0.6 --> 1, 0.4 --> 0).
# Для решения задачи не используйте встроенные функции и функции из модуля math.





